import pytest
from task_1 import unique_names, top_3_names, generate_teachers_dict

lst1 = [['Рома Абрамович', "Рома Бабич", "Вася Аксюта"], ['Рома Абрамович', "Рома Бабич", "Вася Аксюта", "Вася Пупкин"]]
lst2 = [['Ксюша Абрамович', "Федя Бабич", "Юля Аксюта"], ['Юля Абрамович', "Федя Бабич", "Федя Аксюта", "Ксюша Пупкин"]]


@pytest.mark.parametrize(
    'x,expected', [
        (lst1, ['Вася', 'Рома']),
        (lst2, ["Ксюша", 'Федя', "Юля"]),
        ([[]], [])
    ]
)
def test_unique_names(x, expected):
    res = unique_names(x)
    assert set(res) == set(expected)


@pytest.mark.parametrize(
    'x,expected', [
        ([["Евгений Шмаргунов", "Евгений Шмаргунов", "Евгений Шмаргунов", "Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов",
           "Кирилл Табельский", "Кирилл Табельский", "Александр Ульянцев", "Кирилл Табельский",
           "Александр Бардин", "Александр Бардин", "Александр Иванов", "Александр Иванов", "Антон Солонилин", "Максим Филипенко",
           "Елена Никитина",
           "Азамат Искаков",
           "Роман Гордиенко"]], [(5, 'Александр'), (4, 'Евгений'), (3, 'Кирилл')]),
        ([["Евгений Шмаргунов", "Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
           "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая",
           "Денис Ежков",
           "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
          ["Владимир Чебукин", "Эдгар Нуруллин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
           "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин",
           "Михаил Ларченко"]], [(7, 'Александр'), (4, 'Евгений'), (3, 'Эдгар')])
    ]
)
def test_top_3_names(x, expected):
    res = top_3_names(x)
    assert res == expected
